org/20220729171741-control_flow_in_aesara.org
:PROPERTIES:
:ID:       8d8344ab-49e9-480d-b1d6-1336dbf60f9f
:END:
#+title: imperative concepts in Aesara

Control flow is an imperative concept when our symbolic programs is purely descriptive: they do not execute computations but describe how they should be executed. Imperative concepts creep up at several places in =Aesara=:
- =Scan= loops;
- =IfElse=;
- [[id:eb1ede04-0bef-49ac-99dd-a050375d287b][Shared variables]] ;

* References

- I must have written about this when working on MCX
- [[https://www.lesswrong.com/posts/MHL4zzzzuDMjYNX7v/declarative-mathematics][Declarative Mathematics]]
