20220729171741-control_flow_in_aesara.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-01 Thu 10:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>imperative concepts in Aesara</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">imperative concepts in Aesara</h1>
<p>
Control flow is an imperative concept when our symbolic programs is purely descriptive: they do not execute computations but describe how they should be executed. Imperative concepts creep up at several places in <code>Aesara</code>:
</p>
<ul class="org-ul">
<li><code>Scan</code> loops;</li>
<li><code>IfElse</code>;</li>
<li><a href="20220729163811-shared_variables.html#ID-eb1ede04-0bef-49ac-99dd-a050375d287b">Shared variables</a> ;</li>
</ul>

<div id="outline-container-orgcdf0583" class="outline-2">
<h2 id="orgcdf0583">References</h2>
<div class="outline-text-2" id="text-orgcdf0583">
<ul class="org-ul">
<li>I must have written about this when working on MCX</li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://www.lesswrong.com/posts/MHL4zzzzuDMjYNX7v/declarative-mathematics">Declarative Mathematics</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga5c022f" class="outline-2">
<h2 id="orga5c022f">Links to this note</h2>
<div class="outline-text-2" id="text-orga5c022f">
<ul class="org-ul">
<li><a href="./20220729163811-shared_variables.html">Shared variables</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>